[AbstractItems.DLC07_BPAmnesiaDust_AbsItm DisAbstractItem]
m_ItemName="Baffle Dust"
m_PluralItemName=""
m_Description="A chemical compound that facilitates short term confusion. The subject will be momentarily baffled, and then will return to his or her previous behavior."

